brew 'direnv'
brew 'ffmpeg'
brew 'fzf'
brew 'ghq'
brew 'gifsicle'
brew 'git'
brew 'graphviz'
brew 'imagemagick'
brew 'jq'
brew 'jsonnet'
brew 'kayac/tap/ecspresso'
brew 'mise'
brew 'postgresql'
brew 'redis'
brew 'sheldon'
brew 'Songmu/tap/ecschedule'
brew 'tmux'

## Casks
cask 'alacritty'
cask 'alt-tab'
cask 'aws-vault'
cask 'dbngin'
cask 'fork'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'paw'
cask 'raycast'
cask 'slack'
cask 'visual-studio-code'
cask 'vlc'
cask 'yacreader'
cask 'zoom'

# App Store
brew 'mas'
# mas 'Magnet', id: 441258766
