brew 'zsh'
brew 'git'
brew 'git-lfs'
brew 'tmux'
brew 'tmux-xpanes'
brew 'jq'        # JSON
brew 'python-yq' # Yaml
brew 'fzf'       # command-line fuzzy finder
brew 'ghq'
brew 'xz'        # Compress or decompress
brew 'nkf'       # Network Kanji Filter
# brew 'graphviz'  # Graph Visualization
# brew 'watchman'  # Watching changes in the filesystem

brew 'openssl'
brew 'autoconf'
brew 'automake'
brew 'coreutils'

brew 'qemu'
# brew 'iperf'
# brew 'iperf3'
brew 'htop'

# Cloud management tools
brew 'awscli'

# Rails
brew 'postgresql'

# React Native
tap 'facebook/fb'
brew 'idb-companion'

# Multimedia
brew 'youtube-dl'
brew 'ffmpeg'
# brew 'flac'
# brew 'lame'
# brew 'shntool'
# brew 'cuetools'
# cask 'calibre'
# cask 'yacreader'

# Cask
cask 'alfred'
cask 'authy'
cask 'docker-edge'
cask 'firefox'
cask 'flipper'
cask 'fork'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'google-japanese-ime'
cask 'homebrew/cask-versions/visual-studio-code-insiders'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kindle'
cask 'ngrok'
cask 'notion'
cask 'osxfuse'
cask 'paw'
cask 'reactotron'
cask 'rescuetime'
cask 'sequel-pro-nightly'
cask 'slack'
cask 'teamviewer'
cask 'veracrypt'
cask 'vlc'
cask 'xquartz'
cask 'yacreader'
cask 'zoomus'

# App Store
brew 'mas'
mas 'Xcode', id: 497799835
mas 'Magnet', id: 441258766
mas 'TweetDeck', id: 485812721
mas 'The Unarchiver', id: 425424353
mas 'LINE', id: 539883307
mas 'ZIPANG', id: 882655968
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816
